from enum import Enum

class IndustryCode(Enum):
    # 能源
    X1001 = 881002  # 煤炭开采
    X1102 = 881008  # 油服工程
    X1103 = 881011  # 石油化工

    # 化工
    X1201 = 881016  # 日用化工
    X1202 = 881019  # 化纤
    X1203 = 881026  # 化学原料
    X1204 = 881034  # 化学制品
    X1205 = 881044  # 塑料
    X1206 = 881051  # 橡胶
    X1207 = 881055  # 农用化工
    X1208 = 881104  # 非金属材料

    # 金属
    X1301 = 881062  # 冶钢原料
    X1302 = 881065  # 普钢
    X1303 = 881069  # 特钢
    X1401 = 881071  # 工业金属
    X1402 = 881075  # 贵金属
    X1403 = 881078  # 能源金属
    X1404 = 881082  # 稀有金属
    X1405 = 881087  # 金属新材料

    # 建材
    X1501 = 881091  # 水泥
    X1502 = 881094  # 玻璃玻纤
    X1503 = 881097  # 装饰建材

    # 农林牧渔
    X2001 = 881106  # 种植业
    X2002 = 881111  # 养殖业
    X2003 = 881115  # 林业
    X2004 = 881116  # 渔业
    X2005 = 881119  # 饲料
    X2006 = 881123  # 农产品加工
    X2007 = 881127  # 动物保健

    # 食品饮料
    X2102 = 881130  # 酿酒
    X2103 = 881136  # 饮料乳品
    X2104 = 881139  # 调味品
    X2105 = 881140  # 休闲食品
    X2106 = 881144  # 食品加工

    # 纺织服饰
    X2201 = 881151  # 纺织制造
    X2202 = 881157  # 服装家纺
    X2203 = 881162  # 饰品

    # 轻工制造
    X2301 = 881167  # 造纸
    X2302 = 881171  # 包装印刷
    X2303 = 881177  # 家居用品
    X2304 = 881180  # 文娱用品

    # 家电
    X2401 = 881184  # 白色家电
    X2402 = 881187  # 黑色家电
    X2403 = 881190  # 小家电
    X2404 = 881194  # 厨卫电器
    X2406 = 881198  # 家电零部件

    # 商贸
    X2501 = 881200  # 一般零售
    X2503 = 881204  # 商业物业经营
    X2504 = 881205  # 专业连锁
    X2505 = 881206  # 贸易
    X2506 = 881207  # 电子商务

    # 汽车
    X2601 = 881212  # 乘用车
    X2602 = 881215  # 商用车
    X2603 = 881218  # 汽车零部件
    X2604 = 881224  # 汽车服务
    X2605 = 881227  # 摩托车及其他

    # 医药医疗
    X2701 = 881231  # 化学制药
    X2702 = 881234  # 生物制品
    X2703 = 881241  # 医疗器械
    X2704 = 881247  # 医疗服务
    X2705 = 881252  # 医药商业
    X2706 = 881256  # 中药
    X2707 = 881257  # 医疗美容

    # 电力设备
    X3001 = 881261  # 电机制造
    X3002 = 881262  # 电池
    X3003 = 881268  # 电网设备
    X3004 = 881275  # 光伏设备
    X3005 = 881282  # 风电设备
    X3006 = 881285  # 其他发电设备

    # 国防军工
    X3101 = 881287  # 地面兵装
    X3102 = 881288  # 航空装备
    X3103 = 881289  # 航天装备
    X3104 = 881290  # 航海装备
    X3105 = 881291  # 军工电子

    # 机械设备
    X3201 = 881293  # 轨交设备
    X3202 = 881294  # 通用设备
    X3203 = 881303  # 专用设备
    X3204 = 881310  # 工程机械
    X3205 = 881313  # 自动化设备

    # 电子
    X4001 = 881319  # 半导体
    X4002 = 881326  # 消费电子
    X4003 = 881329  # 光学光电
    X4004 = 881333  # 元器件
    X4005 = 881336  # 其他电子

    # 通信
    X4101 = 881338  # 通信设备
    X4102 = 881344  # 电信服务
    X4103 = 881347  # 通信工程

    # 计算机
    X4201 = 881352  # IT设备
    X4202 = 881355  # 软件服务
    X4203 = 881359  # 云服务
    X4204 = 881364  # 产业互联网

    # 传媒
    X4301 = 881369  # 游戏
    X4302 = 881370  # 广告营销
    X4303 = 881373  # 影视院线
    X4304 = 881376  # 数字媒体
    X4306 = 881380  # 出版业
    X4307 = 881384  # 广播电视

    # 银行
    X5001 = 881386  # 全国性银行
    X5002 = 881389  # 地方性银行

    # 非银金融
    X5101 = 881394  # 证券
    X5102 = 881395  # 保险
    X5103 = 881396  # 多元金融

    # 建筑
    X5201 = 881406  # 房屋建设
    X5202 = 881407  # 基础建设
    X5203 = 881410  # 专业工程
    X5204 = 881415  # 工程咨询服务
    X5205 = 881416  # 装修装饰

    # 房地产
    X5301 = 881418  # 房地产开发
    X5302 = 881422  # 房产服务

    # 社会服务
    X6001 = 881427  # 体育
    X6002 = 881428  # 教育培训
    X6003 = 881429  # 酒店餐饮
    X6005 = 881432  # 旅游
    X6006 = 881436  # 专业服务

    # 交通运输
    X6101 = 881442  # 公路铁路
    X6102 = 881446  # 航空机场
    X6103 = 881449  # 航运港口
    X6104 = 881452  # 物流

    # 公用事业
    X6201 = 881459  # 电力
    X6202 = 881467  # 燃气
    X6203 = 881468  # 水务

    # 环保
    X6301 = 881470  # 环保设备
    X6302 = 881471  # 环境治理
    X6303 = 881476  # 环境监测

    # 综合
    X9901 = 881478  # 综合类