# coding=utf-8
from enum import Enum

main_hosts = [
    ("通达信深圳双线主站1", "110.41.147.114", 7709),
    ("通达信深圳双线主站2", "110.41.2.72", 7709),
    ("通达信深圳双线主站3", "110.41.4.4", 7709),
    ("通达信深圳双线主站4", "47.113.94.204", 7709),
    ("通达信深圳双线主站5", "8.129.174.169", 7709),
    ("通达信深圳双线主站6", "110.41.154.219", 7709),
    ("通达信上海双线主站1", "124.70.176.52", 7709),
    ("通达信上海双线主站2", "47.100.236.28", 7709),
    ("通达信上海双线主站3", "123.60.186.45", 7709),
    ("通达信上海双线主站4", "123.60.164.122", 7709),
    ("通达信上海双线主站5", "47.116.105.28", 7709),
    ("通达信上海双线主站6", "124.70.199.56", 7709),
    ("通达信北京双线主站1", "121.36.54.217", 7709),
    ("通达信北京双线主站2", "121.36.81.195", 7709),
    ("通达信北京双线主站3", "123.249.15.60", 7709),
    ("通达信广州双线主站1", "124.71.85.110", 7709),
    ("通达信广州双线主站2", "139.9.51.18", 7709),
    ("通达信广州双线主站3", "139.159.239.163", 7709),
    ("通达信上海双线主站7", "106.14.201.131", 7709),
    ("通达信上海双线主站8", "106.14.190.242", 7709),
    ("通达信上海双线主站9", "121.36.225.169", 7709),
    ("通达信上海双线主站10", "123.60.70.228", 7709),
    ("通达信上海双线主站11", "123.60.73.44", 7709),
    ("通达信上海双线主站12", "124.70.133.119", 7709),
    ("通达信上海双线主站13", "124.71.187.72", 7709),
    ("通达信上海双线主站14", "124.71.187.122", 7709),
    ("通达信武汉电信主站1", "119.97.185.59", 7709),
    ("通达信深圳双线主站7", "47.107.64.168", 7709),
    ("通达信北京双线主站4", "124.70.75.113", 7709),
    ("通达信广州双线主站4", "124.71.9.153", 7709),
    ("通达信上海双线主站15", "123.60.84.66", 7709),
    ("通达信深圳双线主站8", "47.107.228.47", 7719),
    ("通达信北京双线主站5", "120.46.186.223", 7709),
    ("通达信北京双线主站6", "124.70.22.210", 7709),
    ("通达信北京双线主站7", "139.9.133.247", 7709),
    ("通达信广州双线主站5", "116.205.163.254", 7709),
    ("通达信广州双线主站6", "116.205.171.132", 7709),
    ("通达信广州双线主站7", "116.205.183.150", 7709),
]

broker_hosts = [
    # ("长城国瑞电信1", "218.85.139.19", 7709),
    # ("长城国瑞电信2", "218.85.139.20", 7709),
    # ("长城国瑞网通", "58.23.131.163", 7709),
    ("上证云成都电信一", "218.6.170.47", 7709),
    ("上证云北京联通一", "123.125.108.14", 7709),
    ("上海电信主站Z1", "180.153.18.170", 7709),
    # ("上海电信主站Z2", "180.153.18.171", 7709),
    ("上海电信主站Z80", "180.153.18.172", 80),
    # ("北京联通主站Z1", "202.108.253.130", 7709),
    # ("北京联通主站Z2", "202.108.253.131", 7709),
    ("北京联通主站Z80", "202.108.253.139", 80),
    ("杭州电信主站J1", "60.191.117.167", 7709),
    ("杭州电信主站J2", "115.238.56.198", 7709),
    ("杭州电信主站J3", "218.75.126.9", 7709),
    ("杭州电信主站J4", "115.238.90.165", 7709),
    # ("杭州联通主站J1", "124.160.88.183", 7709),
    # ("杭州联通主站J2", "60.12.136.250", 7709),
    # ("杭州华数主站J1", "218.108.98.244", 7709),
    # ("杭州华数主站J2", "218.108.47.69", 7709),
    # ("义乌移动主站J1", "223.94.89.115", 7709),
    # ("青岛联通主站W1", "218.57.11.101", 7709),
    # ("青岛电信主站W1", "58.58.33.123", 7709),
    # ("深圳电信主站Z1", "14.17.75.71", 7709),
    # ("云行情上海电信Z1", "114.80.63.12", 7709),
    # ("云行情上海电信Z2", "114.80.63.35", 7709),
    # ("上海电信主站Z3", "180.153.39.51", 7709),
    # ('招商证券深圳行情', '119.147.212.81', 7709),
    # ('华泰证券(南京电信)', '221.231.141.60', 7709),
    # ('华泰证券(上海电信)', '101.227.73.20', 7709),
    # ('华泰证券(上海电信二)', '101.227.77.254', 7709),
    # ('华泰证券(深圳电信)', '14.215.128.18', 7709),
    # ('华泰证券(武汉电信)', '59.173.18.140', 7709),
    # ('华泰证券(天津联通)', '60.28.23.80', 7709),
    # ('华泰证券(沈阳联通)', '218.60.29.136', 7709),
    # ('华泰证券(南京联通)', '122.192.35.44', 7709),
    # ('华泰证券(南京联通)', '122.192.35.44', 7709),
    # ('安信', '112.95.140.74', 7709),
    # ('安信', '112.95.140.92', 7709),
    # ('安信', '112.95.140.93', 7709),
    # ('安信', '114.80.149.19', 7709),
    # ('安信', '114.80.149.21', 7709),
    # ('安信', '114.80.149.22', 7709),
    # ('安信', '114.80.149.91', 7709),
    # ('安信', '114.80.149.92', 7709),
    # ('安信', '121.14.104.60', 7709),
    # ('安信', '121.14.104.66', 7709),
    # ('安信', '123.126.133.13', 7709),
    # ('安信', '123.126.133.14', 7709),
    # ('安信', '123.126.133.21', 7709),
    # ('安信', '211.139.150.61', 7709),
    ('安信', '59.36.5.11', 7709),
    ('广发', '119.29.19.242', 7709),
    # ('广发', '123.138.29.107', 7709),
    # ('广发', '123.138.29.108', 7709),
    # ('广发', '124.232.142.29', 7709),
    # ('广发', '183.57.72.11', 7709),
    # ('广发', '183.57.72.12', 7709),
    # ('广发', '183.57.72.13', 7709),
    # ('广发', '183.57.72.15', 7709),
    # ('广发', '183.57.72.21', 7709),
    # ('广发', '183.57.72.22', 7709),
    # ('广发', '183.57.72.23', 7709),
    # ('广发', '183.57.72.24', 7709),
    ('广发', '183.60.224.177', 7709),
    ('广发', '183.60.224.178', 7709),
    # ('国泰君安', '113.105.92.100', 7709),
    # ('国泰君安', '113.105.92.101', 7709),
    # ('国泰君安', '113.105.92.102', 7709),
    # ('国泰君安', '113.105.92.103', 7709),
    # ('国泰君安', '113.105.92.104', 7709),
    # ('国泰君安', '113.105.92.99', 7709),
    ('国泰君安', '117.34.114.13', 7709),
    ('国泰君安', '117.34.114.14', 7709),
    ('国泰君安', '117.34.114.15', 7709),
    ('国泰君安', '117.34.114.16', 7709),
    ('国泰君安', '117.34.114.17', 7709),
    ('国泰君安', '117.34.114.18', 7709),
    ('国泰君安', '117.34.114.20', 7709),
    ('国泰君安', '117.34.114.27', 7709),
    ('国泰君安', '117.34.114.30', 7709),
    ('国泰君安', '117.34.114.31', 7709),
    ('国信', '182.131.3.252', 7709),
    # ('国信', '183.60.224.11', 7709),
    # ('国信', '58.210.106.91', 7709),
    # ('国信', '58.63.254.216', 7709),
    # ('国信', '58.63.254.219', 7709),
    ('国信', '58.63.254.247', 7709),
    ('海通', '123.125.108.90', 7709),
    ('海通', '175.6.5.153', 7709),
    ('海通', '182.118.47.151', 7709),
    ('海通', '182.131.3.245', 7709),
    ('海通', '202.100.166.27', 7709),
    # ('海通', '222.161.249.156', 7709),
    # ('海通', '42.123.69.62', 7709),
    ('海通', '58.63.254.191', 7709),
    ('海通', '58.63.254.217', 7709),
    # ('华林', '120.55.172.97', 7709),
    # ('华林', '139.217.20.27', 7709),
    ('华林', '202.100.166.21', 7709),
    ('华林', '202.96.138.90', 7709),
    # ('华林', '218.106.92.182', 7709),
    # ('华林', '218.106.92.183', 7709),
    # ('华林', '220.178.55.71', 7709),
    # ('华林', '220.178.55.86', 7709),
]

ex_hosts = [
    ("扩展市场深圳双线1", "112.74.214.43", 7727),
    ("扩展市场深圳双线2", "120.25.218.6", 7727),
    ("扩展市场深圳双线3", "43.139.173.246", 7727),
    ("扩展市场深圳双线4", "159.75.90.107", 7727),
    ("扩展市场深圳双线5", "106.52.170.195", 7727),
    ("扩展市场广州双线3", "175.24.47.69", 7727),
    ("扩展市场上海双线7", "139.9.191.175", 7727),
    ("扩展市场上海双线1", "150.158.9.199", 7727),
    ("扩展市场上海双线2", "150.158.20.127", 7727),
    ("扩展市场上海双线3", "49.235.119.116", 7727),
    ("扩展市场上海双线4", "49.234.13.160", 7727),
    ("扩展市场广州双线1", "116.205.143.214", 7727),
    ("扩展市场广州双线2", "124.71.223.19", 7727),
    ("扩展市场广州双线3", "123.60.173.210", 7727),
    ("扩展市场上海双线5", "113.45.175.47", 7727),
    ("扩展市场上海双线6", "118.89.69.202", 7727),
]

mac_hosts = [
    ("行情主站1", "121.36.248.138", 7709),  # 板块数据559
    ("行情主站2", "123.60.47.136", 7709),
    ("行情主站3", "121.37.207.165", 7709),
    # ("UNKNOW1", "120.76.1.198", 7709), #板块数据488
    # ("UNKNOW1", "121.37.207.165", 7709),
]


mac_ex_hosts = [
    ("扩展行情1", "116.205.135.205", 7727),
    ("扩展行情2", "121.37.232.167", 7727),
]

class MARKET(Enum):
    # 0 - 深圳， 1 - 上海
    SZ = 0
    SH = 1
    BJ = 2

class CATEGORY(Enum):
    SH = 0      # 上证A
    SZ = 2      # 深证A
    A = 6       # A股
    B = 7       # B股
    KCB = 8     # 科创板
    BJ = 12     # 北证A
    CYB = 14    # 创业板

class PERIOD(Enum):
    MIN_1   = 7     # 1 分钟K 线
    MIN_5   = 0     # 5 分钟K 线
    MIN_15  = 1     # 15分钟K 线
    MIN_30  = 2     # 30分钟K 线
    MIN_60  = 3     # 60分钟K 线
    DAILY   = 4     # 日K 线
    WEEKLY  = 5     # 周K 线
    MONTHLY = 6     # 月K 线
    MINS    = 8     # 多分钟K 线 e.g. 10分钟
    DAYS    = 9     # 多日K 线 e.g. 45日
    QUARTERLY = 10  # 季K 线
    YEARLY  = 11    # 年K 线
    SECONDS = 13    # 多秒K 线 e.g. 5秒 15秒

class ADJUST(Enum):
    NONE = 0        #不复权
    QFQ = 1         #前复权
    HFQ = 2         #后复权


class FILTER_TYPE(Enum):
    NEW = 1  # 未开板次新股
    KC  = 2  # 科创板
    ST  = 4  # ST股
    CY  = 8  # 创业板
    BJ  = 16 # 北证A股

class SORT_TYPE(Enum):
    CODE = 0
    NAME = 0x1
    PRE_CLOSE = 0x2 # 昨收
    OPEN = 0x3 # 今开
    HIGH = 0x4 # 最高
    LOW = 0x5 # 最低
    PRICE = 0x6 # 现价
    BID = 0x7 # 买价
    ASK = 0x8 # 卖价
    VOLUME = 0x9 # 总量
    TOTAL_AMOUNT = 0xa # 总金额
    LAST_VOLUME = 0xb # 现量
    CHANGE = 0xc # 涨跌

    CHANGE_PCT = 0xe # 涨幅%
    AMPLITUDE_PCT = 0xf # 振幅%
    AVG = 0x10 # 均价
    PE_DYNAMIC = 0x11 # 市盈(动)
    ENTRUST_RATIO = 0x12 # 委比%
    INSIDE_VOLUME = 0x13 # 内盘
    OUTSIDE_VOLUME = 0x14 # 外盘
    IN_OUT_RATIO = 0x15 # 内外比

    BID_VOLUME = 0x17 # 买量
    ASK_VOLUME = 0x18 # 卖量

    LOCKED_RATIO = 0x1b # 封成比
    LOCKED_AMOUNT = 0x1c # 封单额
    OPEN_AMOUNT = 0x1d # 开盘金额
    OPEN_TURNOVER_PCT = 0x1e # 开盘换手%

    VOL_RATIO = 0x23 # 量比
    TURNOVER_RATE = 0x24 # 换手%
    FLOAT_SHARES = 0x25 # 流通股(亿)
    FLOAT_MARKET_CAP = 0x26 # 流通市值
    TOTAL_MARKET_CAP_AB = 0x27 # AB股总市值

    UNMATCHED_VOLUME = 0x2a # 未匹配量
    STRENGTH_PCT = 0x2d # 强弱度%
    SPEED_PCT = 0x2e # 涨速%
    ACTIVITY = 0x2f # 活跃度

    SHORT_TURNOVER_PCT = 0xcc # 短换手%
    VOL_SPEED_PCT = 0xd0 # 量涨速%
    MAIN_NET_AMOUNT = 0xd4 # 主力净额
    MAIN_NET_RATIO = 0xd7 # 主力净比%
    AUCTION_LIMIT_BUY = 0x102 # 竞价涨停买
    AMOUNT_2M = 0x10c # 2分钟金额
    OPEN_SNATCH_PCT = 0x10a # 开盘抢筹%
    OPEN_PCT = 0x119 # 开盘%
    HIGH_PCT = 0x11a # 最高%
    LOW_PCT = 0x11b # 最低%
    AVG_CHANGE_PCT = 0x11c # 均涨幅%
    DRAWDOWN_PCT = 0x11e # 回撤%
    ATTACK_PCT = 0x11f # 攻击%

    # INDUSTRY = 0x0 # 细分行业
    # REGION = 0x0 # 地区
    # PREMIUM_PCT = 0x0 # 溢价%
    # PREV_TURNOVER = 0x0 # 昨成交额
    # OPEN_RATIO = 0x0 # 开盘比%
    # OPEN_TIME_RATIO = 0x0 # 开盘时比%
    # OPEN_VOL_RATIO = 0x0 # 开盘量比

    # AUCTION_RATIO = 0x0 # 竞价比
    # LOCKED_ORDERS = 0x0 # 封单数

    # CONSECUTIVE_UP_DAYS = 0x0 # 连涨天
    # PREV_CHANGE_PCT = 0x0 # 昨涨幅%
    # CHANGE_3D_PCT = 0x0 # 3日涨幅%
    # CHANGE_5D_PCT = 0x0 # 5日涨幅%
    # CHANGE_10D_PCT = 0x0 # 10日涨幅%
    # CHANGE_20D_PCT = 0x0 # 20日涨幅%
    # CHANGE_30D_PCT = 0x0 # 30日涨幅%
    # CHANGE_60D_PCT = 0x0 # 60日涨幅%
    # CHANGE_1Y_PCT = 0x0 # 一年涨幅%
    # MTD_PCT = 0x0 # 月初至今%
    # YTD_PCT = 0x0 # 年初至今%
    # YEAR_CHANGE_PCT = 0x0 # 年涨幅%
    # YEAR_CHANGE_DAYS = 0x0 # 年涨幅天数
    # TURNOVER_Z = 0x0 # 换手Z
    # FLOAT_MCAP_Z = 0x0 # 流通市值Z
    # MCAP_CHANGE = 0x0 # 市值增减
    # PE_TTM = 0x0 # 市盈(TTM)
    # PE_STATIC = 0x0 # 市盈率(静)
    # BETA = 0x0 # 贝塔系数
    # DIST_MA5_PCT = 0x0 # 距5日线%
    # RECENT_INDICATOR = 0x0 # 近日指标提示
    # SHORT_TERM_PATTERN = 0x0 # 短期形态
    # MEDIUM_TERM_PATTERN = 0x0 # 中期形态
    # LONG_TERM_PATTERN = 0x0 # 长期形态
   
    # FINANCIAL_UPDATE = 0x0 # 财务更新
    # LISTING_DATE = 0x0 # 上市日期
    # TOTAL_SHARES = 0x0 # 总股本(亿)
    # BA_SHARES = 0x0 # B/A股(亿)
    # H_SHARES = 0x0 # H股(亿)
    # REPORT_PERIOD = 0x0 # 报告期
    # TOTAL_ASSETS = 0x0 # 总资产(亿)
    # NET_ASSETS = 0x0 # 净资产(亿)
    # MINORITY_INTEREST = 0x0 # 少数股权(亿)
    # DEBT_TO_ASSETS_RATIO = 0x0 # 资产负债率%
    # CURRENT_ASSETS = 0x0 # 流动资产(亿)
    # FIXED_ASSETS = 0x0 # 固定资产(亿)
    # INTANGIBLE_ASSETS = 0x0 # 无形资产(亿)
    # CURRENT_LIABILITIES = 0x0 # 流动负债(亿)
    # CASH = 0x0 # 货币资金(亿)
    # INVENTORY = 0x0 # 存货(亿)
    # ACCOUNTS_RECEIVABLE = 0x0 # 应收账款(亿)
    # CONTRACT_LIABILITIES = 0x0 # 合同负债(亿)
    # CAPITAL_RESERVE = 0x0 # 资本公积金(亿)
    # OPERATING_REVENUE = 0x0 # 营业收入(亿)
    # OPERATING_COST = 0x0 # 营业成本(亿)
    # OPERATING_PROFIT = 0x0 # 营业利润(亿)
    # INVESTMENT_INCOME = 0x0 # 投资收益(亿)
    # TOTAL_PROFIT = 0x0 # 利润总额(亿)
    # AFTER_TAX_PROFIT = 0x0 # 税后利润(亿)
    # NET_PROFIT = 0x0 # 净利润(亿)
    # CORE_NET_PROFIT = 0x0 # 扣非净利润(亿)
    # RETAINED_EARNINGS = 0x0 # 未分配利润(亿)
    # OPERATING_CASH_FLOW = 0x0 # 经营现金流(亿)
    # TOTAL_CASH_INFLOW = 0x0 # 总现金流入(亿)
    # SHAREHOLDER_COUNT = 0x0 # 股东人数
    # AVG_SHARES_PER_HOLDER = 0x0 # 人均持股
    # AVG_MCAP_PER_HOLDER = 0x0 # 人均市值
    # PROFIT_YOY_PCT = 0x0 # 利润同比%
    # REVENUE_YOY_PCT = 0x0 # 收入同比%
    # PB = 0x0 # 市净率
    # PE_RATIO = 0x0 # 市盈率
    # PS = 0x0 # 市销率
    # DIVIDEND_YIELD = 0x0 # 股息率%
    # EPS = 0x0 # 每股收益
    # BPS = 0x0 # 每股净资产
    # CAPITAL_RESERVE_PS = 0x0 # 每股公积
    # RETAINED_EARNINGS_PS = 0x0 # 每股未分配
    # CASH_FLOW_PS = 0x0 # 每股现金流
    # EQUITY_RATIO = 0x0 # 权益比%
    # NET_MARGIN = 0x0 # 净利率%
    # GROSS_MARGIN = 0x0 # 毛利率%
    # OPERATING_MARGIN = 0x0 # 营业利润率%
    # NET_PROFIT_MARGIN = 0x0 # 净利润率%
    # R_D_EXPENSE = 0x0 # 研发费用(亿)
    # EMPLOYEE_COUNT = 0x0 # 员工人数
    # ISSUE_TYPE = 0x0 # 发行类型
    # TICKER = 0x0 # 交易代码
    # WATCHLIST_DATE = 0x0 # 自选日
    # WATCHLIST_PRICE = 0x0 # 自选价
    # WATCHLIST_RETURN_PCT = 0x0 # 自选收益率%
    

class BLOCK_FILE_TYPE(Enum):
    DEFAULT = 'block.dat'   # 一般板块
    ZS = 'block_zs.dat'     # 指数板块
    FG = 'block_fg.dat'     # 风格板块
    GN = 'block_gn.dat'     # 概念板块

class BOARD_TYPE(Enum):
    HY = 0
    HY2 = 1

    GN = 3
    FG = 4
    DQ = 5
    
    UNKNOW = 6             #其他 397个
    HY_OTHER = 7           #行业 30个
    
    OTHER11 = 8     #行业板块-其他     等同于0 可能是兼容
    OTHER12 = 9     #行业板块-二级行业  等同于1 可能是兼容
    ALL = 255       #全部板块

class EX_BOARD_TYPE(Enum):
    HK_ALL = 0  # 港股板块
    HK_GN = 1  # 港股概念板块
    HK_HY = 2  # 港股行业板块
    US_ALL = 3  # 美股板块
    US_GN = 4  # 美股概念板块
    US_HY = 5  # 美股行业板块
    
class EX_MARKET(Enum):
    STOCK = 1               # 股票
    HK = 2                  # 香港
    FUTURES = 3             # 期货
    FX = 4                  # 汇率
    INDEX = 5               # 指数
    VALUATION = 6           # 估值
    MONEY = 7               # 资金
    FUND = 8                # 基金
    MONETARY_FUND = 9       # 货币基金
    INDICATOR = 10          # 指标
    MIRROR = 11             # 镜像
    OPTION = 12             # 期权
    US = 13                 # 美国
    DE = 14                 # 德国
    SG = 15                 # 新加坡

class EX_CATEGORY(Enum):
    TEMP_STOCK = 1                  # 临时股
    ZZ_FUTURES_OPTION = 4           # 郑州商品期权
    DL_FUTURES_OPTION = 5           # 大连商品期权
    SH_FUTURES_OPTION = 6           # 上海商品期权
    CFFEX_OPTION = 7                # 中金所期权
    SH_STOCK_OPTION = 8             # 上海股票期权
    SZ_STOCK_OPTION = 9             # 深圳股票期权
    BASIC_FX = 10                   # 基本汇率
    CROSS_FX = 11                   # 交叉汇率
    INTL_INDEX = 12                 # 国际指数
    COMEX_FUTURES = 16              # 纽约COMEX
    NYMEX_FUTURES = 17              # 纽约NYMEX
    CBOT_FUTURES = 18               # 芝加哥CBOT
    HK_FINANCIAL_FUTURES = 23       # 香港金融期货
    HK_FINANCIAL_OPTIONS = 24       # 香港金融期权
    HK_STOCK_FUTURES = 25           # 香港股票期货
    HK_STOCK_OPTIONS = 26           # 香港股票期权
    HK_INDEX = 27                   # 香港指数
    ZZ_FUTURES = 28                 # 郑州商品
    DL_FUTURES = 29                 # 大连商品
    SH_FUTURES = 30                 # 上海期货
    HK_MAIN_BOARD = 31              # 香港主板
    OPEN_END_FUND = 33              # 开放式基金
    MONETARY_FUND = 34              # 货币型基金
    MACRO_INDICATOR = 38            # 宏观指标
    FUTURES_INDEX = 42              # 商品指数
    B_TO_H = 43                     # B股转H股
    NEEQ = 44                       # 股转系统
    SH_GOLD = 46                    # 上海黄金
    CFFEX_FUTURES = 47              # 中金所期货
    HK_GEM = 48                     # 香港创业板
    HK_FUND = 49                    # 香港基金
    TREASURY_VALUATION = 54         # 国债预发行
    SUNSHINE_PRIVATE_FUND = 56      # 阳光私募基金
    BROKER_COLLECTIVE_FINANCE = 57  # 券商集合理财
    BROKER_MONETARY_FINANCE = 58    # 券商货币理财
    MAIN_FUTURES_CONTRACT = 60      # 主力期货合约
    CSI_INDEX = 62                  # 中证指数
    GZ_ARBITRAGE_FUTURES = 65       # 广州套利期货
    GZ_FUTURES = 66                 # 广州期货
    GZ_OPTIONS = 67                 # 广州期权
    RISK_CONTROL_INDEX = 68         # 风控指数
    HUAZHENG_INDEX = 69             # 华证指数
    EXTENDED_SECTOR_INDEX = 70      # 扩展板块指数
    HK_STOCK = 71                   # 港股
    GE_STOCK = 73                   # 德国股票
    US_STOCK = 74                   # 美国股票
    SG_STOCK = 78                   # 新加坡股票
    MONEY_MARKET = 91               # 资金市场
    FUND_VALUATION = 93             # 基金估值
    HK_DARK_POOL = 98               # 港股暗盘
    CODE_MIRROR = 100               # 代码镜像
    SZSE_INDEX = 102                # 国证指数